Catalogs/ХранилищеВнешнихОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ХранилищеВнешнихОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикрепляемыйФайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьОтПользователей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внутренний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ХранилищеВнешнихОтчетов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не ОбъектыСервер.РазыменоватьСсылку(ВыбраннаяСтрока, "ЭтоГруппа") Тогда	
		СтандартнаяОбработка = Ложь;
		ИмяОтчета = ОбъектыСервер.РазыменоватьСсылку(ВыбраннаяСтрока, "ИмяОтчета");
		Если ИмяОтчета = "бтИсторияЗвонков" Тогда
			ИмяОтчета = "бит_ИсторияЗвонков";
		КонецЕсли;	
		Если ОбъектыСервер.РазыменоватьСсылку(ВыбраннаяСтрока, "Внутренний") Тогда
			ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма");		
		Иначе
			Попытка
				ОткрытьФорму("ВнешнийОтчет." + ИмяОтчета + ".Форма");
			Исключение
				Попытка	
					ПодключитьВнешнийОтчет(ВыбраннаяСтрока);
					ОткрытьФорму("ВнешнийОтчет." + ИмяОтчета + ".Форма");
				Исключение
					Сообщить("Ошибка получения отчета!");
				КонецПопытки;
			КонецПопытки;			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодключитьВнешнийОтчет(ОтчетСсылка)
	АдресХранилища = ПоместитьВоВременноеХранилище(ОтчетСсылка.Хранилище.Получить(), Новый УникальныйИдентификатор());
	ВнешниеОтчеты.Подключить(АдресХранилища, ОтчетСсылка.ИмяОтчета, Ложь);
КонецПроцедуры
